Catalogs/Currencies.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Catalog>
		<Properties>
			<Name>Currencies</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>DescriptionLong</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SpellingSettings</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BaseCurrency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Currencies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DependentRateCoefficient</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsDownloable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Currencies/Forms/ISO4217/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)

	CloseOnChoice = False;
	FillCurrencyTable();
	
EndProcedure


&AtClient
Procedure ListCurrenciesSelection(Item, SelectedRow, Field, StandardProcessing)
	ProcessSelectionInListCurrencies(Item.CurrentData);
EndProcedure


&AtServer
// Fills currency list from ISO4217 template
//
Procedure FillCurrencyTable()
	
	XMLList = Catalogs.Currencies.GetTemplate("ISO4217").GetText();
	
	Table = ModuleCommon.ReadXMLIntoTable(XMLList).Data;
	
	For each Row In Table Do
		NewRow = Currencies.Add();
		NewRow.Code           = Row.Code;
		NewRow.CodeAlphabetic = Row.CodeSymbol;
		NewRow.Currency       = Row.Name;
		NewRow.Entity         = Row.Description;
		NewRow.IsDownloable   = False;
	EndDo;
	
EndProcedure


&AtClient
Procedure Choose(Command)
	ProcessSelectionInListCurrencies(Items.ListCurrencies.CurrentData);
EndProcedure


&AtClient
// On selected event handler of ListCurrencies control
// Notifies the parent form about choice. Closes the form.
//
Procedure ProcessSelectionInListCurrencies(CurrentData)
	
	ChoiceParameters = New Structure("Code, Description, DescriptionLong, IsDownloable");
	ChoiceParameters.Code             = CurrentData.Code;
	ChoiceParameters.Description      = CurrentData.CodeAlphabetic;
	ChoiceParameters.DescriptionLong  = CurrentData.Currency;
	ChoiceParameters.IsDownloable     = CurrentData.IsDownloable;
	
	NotifyChoice(ChoiceParameters);
	
EndProcedure
